code/openfoam/tutorials/incompressibleFluid/ductSecondaryFlow/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentEpsilon];

internalField   uniform 0.00613;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottomWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    leftWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
