code/openfoam/tutorials/incompressibleFluid/ductSecondaryFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver              GAMG;
        smoother            DIC;

        tolerance           1e-8;
        relTol              0.01;
    }

    "(U|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-6;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;

    pRefCell 0;
    pRefValue 0;

    residualControl
    {
        p       5e-5;
        U       1e-5;
        epsilon 1e-5;
        R       1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U       0.9;
        k       0.9;
        R       0.9;
        epsilon 0.9;
    }
}


// ************************************************************************* //
